src/Documents/ОбменВалюты/ОбменВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбменВалюты</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВалютаИз</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВ</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоКурсу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Гривна</name>
      <description>Гривна</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>Доллар</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
  </predefined>
  <attributes>
    <name>КодЧисловой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСимвольный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ОбменВалюты/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Организация = Константы.ОсновнаяОрганизация.Получить (); 
	Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	курсы = ОбщийДокументы.ПолучитьКурс ( ТекущаяДата (), ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) );
	Объект.Курс = курсы.Курс;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаИзПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВПриИзменении ( Элемент )
	
	рассчитатьСумму ();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПоКурсуПриИзменении ( Элемент )
	
	рассчитатьСумму ();	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуПоКурсу ()
	
	Если ( Объект.Курс = 0 ) Тогда
		Сообщить ( "Не указан курс!", СтатусСообщения.Важное );   		
		Объект.СуммаПоКурсу = 0; 
		Возврат;
	КонецЕсли;
	Если ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1 / Объект.Курс; 
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = Объект.Курс; 
	КонецЕсли; 	
	Объект.СуммаПоКурсу = Объект.Сумма * к;  
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСумму ()
	
	Если ( Объект.Курс = 0 ) Тогда
		Сообщить ( "Не указан курс!", СтатусСообщения.Важное );   		
		Объект.Сумма = 0; 
		Возврат;
	КонецЕсли;
	Если ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1 / Объект.Курс; 
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = Объект.Курс; 
	КонецЕсли; 	
	Объект.Сумма = Объект.СуммаПоКурсу * к;
	
КонецПроцедуры
